/******************************************************************
* 	        Marvell Semiconductor  
*******************************************************************
* \file common.h
* \purpose Definitions, Declaration
* \History
*	10/13/2015 Heejeong Ryu		Initial 
*/
#ifndef COMMON_H
#define COMMON_H

#include <compiler.h>
#include "sfr_r8051.h"

// code banking controls
// Comment out USE_BANKING definition to use 64k version of FW. makefile needs adjustment, too.
// #define USE_BANKING
#ifdef USE_BANKING
#define BANKING_CTRL __banked
#else
#define BANKING_CTRL
#endif

#define CMD_BANK
#define EOM_BANK 
#define RXTRAIN_BANK 

typedef unsigned char uint8_t;
typedef unsigned int  uint16_t;
typedef unsigned long uint32_t;

typedef signed char   int8_t;
typedef signed int    int16_t;
typedef signed long   int32_t;

typedef unsigned char bool;
typedef __bit         BIT;
#define at			  __at

// compile options
#include "config.h"

#define ANA_TRX_LANE_BASE    	0x0000
#define ANA_DFEE_LANE_BASE   	0x0200
#define ANA_DFEO_LANE_BASE   	0x0300
#define TX_LANE_BASE         	0x2000
#define RX_LANE_BASE         	0x2100
#define MCU_LANE_BASE        	0x2200
#define PHYTEST_LANE_BASE    	0x2300
#define RX_EQ_LANE_BASE      	0x2400
#define TX_TRAIN_IF_LANE_BASE	0x2600
#define PIPE_LANE_BASE       	0x4000
#define XDAT_LANE_BASE       	0x6000
#define ANA_CMN_BASE         	0x8000
#define TX_CMN_BASE          	0xA000
#define RX_CMN_BASE          	0xA100

	EYEWIDTH_RIGHT_MEASURE_STATE, //12
	PHASE_FINE_ADAPT_PER_EYEWIDTH_STATE,//13
	PHASE_ACCU_ADAPT_PER_EYEWIDTH_STATE,//14
	EYE_HEIGHT_MEASURE_STATE, //15
	EYE_HEIGHT_RESULT_STATE, //16
	EYE_DIAGRAM_CAPTURE_STATE, //17
	EYE_DIAGRAM_RESULT_STATE, //18
	OFST_ADAPT_STATE, //19
	EYE_CHECK_STATE, //1a
	IDLE_STATE //1b
};

enum DFE_FSM_STAGE_t {
DFE_FSM_RESET_STATE,
DFE_FSM_DTL_STATE,	
DFE_FSM_F0A_STATE,   
DFE_FSM_DFE_CORASE_STATE,
DFE_FSM_DFE_FINE_STATE,   
DFE_FSM_DFE_ACCU_STATE,   
DFE_FSM_OFST_STATE,   
DFE_FSM_F0B_FINE_STATE,   
DFE_FSM_F0B_ACCU_STATE, 
DFE_FSM_F0D_FINE_STATE,
DFE_FSM_F0D_COARSE_STATE,
DFE_FSM_FASTACQ_STATE,
};

// CDS Save //
typedef enum {
    Savf0a      = 0x00,
    Savf0b      = 0x01,
    Savf0d      = 0x02,
    Savf0d_l    = 0x03,
    Savf0d_r    = 0x04,
    Savf0k      = 0x06,
    Savdfe      = 0x10,
    Saveyechk   = 0x11,
    Savdc       = 0x12
} CDS_sav_t;

//
#define tag_edge_sampler_normal_en  1
//#define tag_phase_adapt_temp_thr	lnx_PHASE_ADAPT_TEMP_THR_LANE_7_0 //12  //5'

// -- cds registers
#define SLICER_SMPL_ONLY	1
#define BOTH_SMPL			0

#define MAXEO_ADAPT_MODE		0
#define MMSE_ADAPT_MODE			1


//--- train interface

//error code
#define UNKNOWN_ERROR		     		0
#define UNSUPPORTED_PATTERN_TYPE 		1
#define RESERVED_PATTERN_TYPE    	 	2
#define RESERVED_TTIU_BIT_SET_TO_ONE 	3   
#define MULTI_RESERVED_COE_REQ			0x10
#define RESERVED_COE_1_REQ				0x11
#define RESERVED_COE_2_REQ				0x13
#define RESERVED_COE_3_REQ				0x15
#define RESERVED_COMB_COE_REQ			0x1A

//status
#define READY		0
#define UPDATED		1
#define MIN			2
#define MAX			3
#define C1_is_max  		0x30	
#define C1_is_min  		0x20	
#define C1_updated  	0x10	
#define C0_is_max  		0x0c	
#define C0_is_min  		0x08	
#define C0_updated	  	0x04	
#define Cn1_is_max  	0x03	
#define Cn1_is_min  	0x02	
#define Cn1_updated  	0x01	

#define tx_amp_max			lnx_TX_EM_PEAK_MAX_LANE_3_0 //0x0e 
#define tx_amp_min			0//lnx_TX_EM_PEAK_MIN_LANE_3_0 //0 	 
#define tx_emph1_max		lnx_TX_EM_PO_MAX_LANE_3_0 //0xf	 
#define tx_emph1_min		0//lnx_TX_EM_PO_MIN_LANE_3_0 //0 	 
#define tx_emph0_max		lnx_TX_EM_PRE_MAX_LANE_3_0 //0xf 
#define tx_emph0_min		0//lnx_TX_EM_PRE_MIN_LANE_3_0 //0 	 
#define tx_amp_offset		0 	 
#define C1_MAX				tx_emph1_max
#define C1_MIN				tx_emph1_min
#define C0_MAX				tx_amp_max
#define C0_MIN				tx_amp_min
#define CN1_MAX				tx_emph0_max
#define CN1_MIN				tx_emph0_min
#define tag_TX_VMA_PROTECT_EN	0 //todo ???1	
#define tag_TX_POWER_PROTECT_EN 0 //todo ???1 
#define tx_vma_min          4 	 //reg_TX_VMA_MIN_3_0   
#define tx_power_max		0x1c //reg_TX_POWER_MAX_5_0 

// -- macro 
#define simulation_stop()			reg_MCU_DEBUG_CMN_7_7_0 = 0xbb 
#define simulation_start()			reg_MCU_DEBUG_CMN_0_7_0 = 0xaa 

// ---
		
#define req_local_ctrl(s,a,b,c) 	Send_ctrl_to_tx((s)|((a)<<4)|((b)<<2)|(c))

// -- Assign a bitfield to a whole byte
#define ASSIGN8(a,b) {a = 0xff & b;}
#define ASSIGN16(a,b) {a = 0xffff & b;}
#define ASSIGN32(a,b) {a = 0xffffffff & b;}

// -- structure define

typedef struct REG_tag{
	uint16_t addr;
	uint8_t lo, mask;
} REG_t;

typedef struct Status_dfe_sm_struct{ //size 62+2 bytes
	uint8_t f0_d_p_e, f0_d_n_e, f0_s_p_e, f0_s_n_e;
	uint8_t f2_d_p_e, f2_d_n_e, f2_s_p_e, f2_s_n_e;
	uint8_t f3_d_p_e, f3_d_n_e, f3_s_p_e, f3_s_n_e;
	uint8_t f1_e, f4_e, f5_e, f6_e, f7_e, f8_e, f9_e;
	uint8_t f10_e, f11_e, f12_e, f13_e, f14_e, f15_e;
	uint8_t ff0_e, ff1_e, ff2_e, ff3_e, ff4_e, ff5_e;
	uint8_t	dummy_e;
	uint8_t f0_d_p_o, f0_d_n_o, f0_s_p_o, f0_s_n_o;
	uint8_t f2_d_p_o, f2_d_n_o, f2_s_p_o, f2_s_n_o;
	uint8_t f3_d_p_o, f3_d_n_o, f3_s_p_o, f3_s_n_o;
	uint8_t f1_o, f4_o, f5_o, f6_o, f7_o, f8_o, f9_o;
	uint8_t f10_o, f11_o, f12_o, f13_o, f14_o, f15_o;
	uint8_t ff0_o, ff1_o, ff2_o, ff3_o, ff4_o, ff5_o;
	uint8_t	dummy_o;
} Status_dfe_sm_t;

typedef struct Status_dfe_2c_struct{
	int8_t f0_d_p_e, f0_d_n_e, f0_s_p_e, f0_s_n_e;
	int8_t f2_d_p_e, f2_d_n_e, f2_s_p_e, f2_s_n_e;
	int8_t f3_d_p_e, f3_d_n_e, f3_s_p_e, f3_s_n_e;
	int8_t f1_e, f4_e, f5_e, f6_e, f7_e, f8_e, f9_e;
	int8_t f10_e, f11_e, f12_e, f13_e, f14_e, f15_e;
	int8_t ff0_e, ff1_e, ff2_e, ff3_e, ff4_e, ff5_e;
	int8_t	dummy_e;
	int8_t f0_d_p_o, f0_d_n_o, f0_s_p_o, f0_s_n_o;
	int8_t f2_d_p_o, f2_d_n_o, f2_s_p_o, f2_s_n_o;
	int8_t f3_d_p_o, f3_d_n_o, f3_s_p_o, f3_s_n_o;
	int8_t f1_o, f4_o, f5_o, f6_o, f7_o, f8_o, f9_o;
	int8_t f10_o, f11_o, f12_o, f13_o, f14_o, f15_o;
	int8_t ff0_o, ff1_o, ff2_o, ff3_o, ff4_o, ff5_o;
	int8_t	dummy_o;
} Status_dfe_2c_t;

typedef struct Status_dfe_sm_dc_struct{ 
    uint8_t dc_d_p_e, dc_d_n_e, dc_s_p_e, dc_s_n_e;     
    uint8_t dc_d_p_o, dc_d_n_o, dc_s_p_o, dc_s_n_o;     
} Status_dfe_sm_dc_t; 

typedef struct Status_dfe_2c_dc_struct{ 
    int8_t dc_d_p_e, dc_d_n_e, dc_s_p_e, dc_s_n_e;     
    int8_t dc_d_p_o, dc_d_n_o, dc_s_p_o, dc_s_n_o;     
} Status_dfe_2c_dc_t; 

// ----
// new cds structure
typedef struct {
    uint8_t d_p_e;
    uint8_t d_n_e;
    uint8_t s_p_e;
    uint8_t s_n_e;
    uint8_t d_p_o;
    uint8_t d_n_o;
    uint8_t s_p_o;
    uint8_t s_n_o;
} dfe_f0_t;
/*
typedef struct Status_dfe_struct{ // 72 bytes
    uint8_t f0_d_p_e, f0_d_n_e, f0_s_p_e, f0_s_n_e;     // 0x80
    uint8_t f2_d_p_e, f2_d_n_e, f2_s_p_e, f2_s_n_e;     // 0x84
    uint8_t f3_d_p_e, f3_d_n_e, f3_s_p_e, f3_s_n_e;     // 0x88
    uint8_t f1_e, f4_e, f5_e, f6_e;                     // 0x8c
    uint8_t f7_e, f8_e, f9_e, f10_e;                    // 0x90
    uint8_t f11_e, f12_e, f13_e, f14_e;                 // 0x94
    uint8_t f15_e, ff0_e, ff1_e, ff2_e;                 // 0x98
    uint8_t ff3_e, ff4_e, ff5_e, dummy_e;               // 0x9c

    uint8_t f0_d_p_o, f0_d_n_o, f0_s_p_o, f0_s_n_o;     
    uint8_t f2_d_p_o, f2_d_n_o, f2_s_p_o, f2_s_n_o;     
    uint8_t f3_d_p_o, f3_d_n_o, f3_s_p_o, f3_s_n_o;     
    uint8_t f1_o, f4_o, f5_o, f6_o;                     
    uint8_t f7_o, f8_o, f9_o, f10_o;                    
    uint8_t f11_o, f12_o, f13_o, f14_o;                 
    uint8_t f15_o, ff0_o, ff1_o, ff2_o;                 
    uint8_t ff3_o, ff4_o, ff5_o, dummy_o;               

    uint8_t dc_d_p_e, dc_d_n_e, dc_s_p_e, dc_s_n_e;     // 0xc0
    uint8_t dc_d_p_o, dc_d_n_o, dc_s_p_o, dc_s_n_o;     // 0xc4
} Status_dfe_t; // Saved tap values
*/
typedef struct {
    Status_dfe_2c_t dfe_2c; // 64 //72
    Status_dfe_2c_dc_t dfe_2c_dc; // 8    
    dfe_f0_t f0a; // 8
    dfe_f0_t f0b; // 8
    dfe_f0_t f0d; // 8
    dfe_f0_t f0d_left; // 8
    dfe_f0_t f0d_right; // 8
//    dfe_dc_t dc; // 10
//    int8_t dc_e_e; // 28G no edge eq
//    int8_t dc_e_o;
//    dfe_res_t dfe_res; // 5
    bool eye_check_pass;
    bool f0a_saturate;
//    bool dfe_saturate;
//    bool saturated; 
} Status_CDS_28G_t; // 114 Byte

// -----
typedef struct Status_Train_tag {
	uint8_t f0a_data, f0a_slicer;
	uint8_t f0a_max_data, f0a_max_slicer;
	uint8_t f0_data, f0_slicer;
	int8_t f1;// value of ISI taps
	int8_t f2_data, f2_slicer;
	int8_t f3_data, f3_slicer;
	int8_t f4;
	int8_t f5;
	int8_t f6;
	int8_t f7;
	uint8_t eo_data, eo_slicer;
	uint8_t f0d_data_left, f0d_slicer_left;
	uint8_t f0d_data_right, f0d_slicer_right;
	int8_t eye_check_pass;
